espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG27/Include/efr32bg27c320f768gj39.h
#define EMU_S              ((EMU_TypeDef *) EMU_S_BASE)                       /**< EMU_S base pointer */
#define CMU_S              ((CMU_TypeDef *) CMU_S_BASE)                       /**< CMU_S base pointer */
#define HFXO0_S            ((HFXO_TypeDef *) HFXO0_S_BASE)                    /**< HFXO0_S base pointer */
#define HFRCO0_S           ((HFRCO_TypeDef *) HFRCO0_S_BASE)                  /**< HFRCO0_S base pointer */
#define FSRCO_S            ((FSRCO_TypeDef *) FSRCO_S_BASE)                   /**< FSRCO_S base pointer */
#define DPLL0_S            ((DPLL_TypeDef *) DPLL0_S_BASE)                    /**< DPLL0_S base pointer */
#define LFXO_S             ((LFXO_TypeDef *) LFXO_S_BASE)                     /**< LFXO_S base pointer */
#define LFRCO_S            ((LFRCO_TypeDef *) LFRCO_S_BASE)                   /**< LFRCO_S base pointer */
#define ULFRCO_S           ((ULFRCO_TypeDef *) ULFRCO_S_BASE)                 /**< ULFRCO_S base pointer */
#define MSC_S              ((MSC_TypeDef *) MSC_S_BASE)                       /**< MSC_S base pointer */
#define ICACHE0_S          ((ICACHE_TypeDef *) ICACHE0_S_BASE)                /**< ICACHE0_S base pointer */
#define PRS_S              ((PRS_TypeDef *) PRS_S_BASE)                       /**< PRS_S base pointer */
#define GPIO_S             ((GPIO_TypeDef *) GPIO_S_BASE)                     /**< GPIO_S base pointer */
#define LDMA_S             ((LDMA_TypeDef *) LDMA_S_BASE)                     /**< LDMA_S base pointer */
#define LDMAXBAR_S         ((LDMAXBAR_TypeDef *) LDMAXBAR_S_BASE)             /**< LDMAXBAR_S base pointer */
#define TIMER0_S           ((TIMER_TypeDef *) TIMER0_S_BASE)                  /**< TIMER0_S base pointer */
#define TIMER1_S           ((TIMER_TypeDef *) TIMER1_S_BASE)                  /**< TIMER1_S base pointer */
#define TIMER2_S           ((TIMER_TypeDef *) TIMER2_S_BASE)                  /**< TIMER2_S base pointer */
#define TIMER3_S           ((TIMER_TypeDef *) TIMER3_S_BASE)                  /**< TIMER3_S base pointer */
#define TIMER4_S           ((TIMER_TypeDef *) TIMER4_S_BASE)                  /**< TIMER4_S base pointer */
#define USART0_S           ((USART_TypeDef *) USART0_S_BASE)                  /**< USART0_S base pointer */
#define USART1_S           ((USART_TypeDef *) USART1_S_BASE)                  /**< USART1_S base pointer */
#define BURTC_S            ((BURTC_TypeDef *) BURTC_S_BASE)                   /**< BURTC_S base pointer */
#define I2C1_S             ((I2C_TypeDef *) I2C1_S_BASE)                      /**< I2C1_S base pointer */
#define SYSCFG_S_CFGNS     ((SYSCFG_CFGNS_TypeDef *) SYSCFG_S_CFGNS_BASE)     /**< SYSCFG_S_CFGNS base pointer */
#define SYSCFG_S           ((SYSCFG_TypeDef *) SYSCFG_S_BASE)                 /**< SYSCFG_S base pointer */
#define BURAM_S            ((BURAM_TypeDef *) BURAM_S_BASE)                   /**< BURAM_S base pointer */
#define GPCRC_S            ((GPCRC_TypeDef *) GPCRC_S_BASE)                   /**< GPCRC_S base pointer */
#define DCDC_S             ((DCDC_TypeDef *) DCDC_S_BASE)                     /**< DCDC_S base pointer */
#define PDM_S              ((PDM_TypeDef *) PDM_S_BASE)                       /**< PDM_S base pointer */
#define SEPUF_S_APBCFG     ((SEPUF_APBCFG_TypeDef *) SEPUF_S_APBCFG_BASE)     /**< SEPUF_S_APBCFG base pointer */
#define ETAMPDET_S         ((ETAMPDET_TypeDef *) ETAMPDET_S_BASE)             /**< ETAMPDET_S base pointer */
#define RADIOAES_S         ((AES_TypeDef *) RADIOAES_S_BASE)                  /**< RADIOAES_S base pointer */
#define SMU_S              ((SMU_TypeDef *) SMU_S_BASE)                       /**< SMU_S base pointer */
#define SMU_S_CFGNS        ((SMU_CFGNS_TypeDef *) SMU_S_CFGNS_BASE)           /**< SMU_S_CFGNS base pointer */
#define RTCC_S             ((RTCC_TypeDef *) RTCC_S_BASE)                     /**< RTCC_S base pointer */
#define LETIMER0_S         ((LETIMER_TypeDef *) LETIMER0_S_BASE)              /**< LETIMER0_S base pointer */
#define IADC0_S            ((IADC_TypeDef *) IADC0_S_BASE)                    /**< IADC0_S base pointer */
#define ACMP0_S            ((ACMP_TypeDef *) ACMP0_S_BASE)                    /**< ACMP0_S base pointer */
#define I2C0_S             ((I2C_TypeDef *) I2C0_S_BASE)                      /**< I2C0_S base pointer */
#define WDOG0_S            ((WDOG_TypeDef *) WDOG0_S_BASE)                    /**< WDOG0_S base pointer */
#define AMUXCP0_S          ((AMUXCP_TypeDef *) AMUXCP0_S_BASE)                /**< AMUXCP0_S base pointer */
#define EUSART0_S          ((EUSART_TypeDef *) EUSART0_S_BASE)                /**< EUSART0_S base pointer */
#define CRYPTOACC_S        ((CRYPTOACC_TypeDef *) CRYPTOACC_S_BASE)           /**< CRYPTOACC_S base pointer */
#define PRORTC_S           ((RTCC_TypeDef *) PRORTC_S_BASE)                   /**< PRORTC_S base pointer */
#define EMU_NS             ((EMU_TypeDef *) EMU_NS_BASE)                      /**< EMU_NS base pointer */
#define CMU_NS             ((CMU_TypeDef *) CMU_NS_BASE)                      /**< CMU_NS base pointer */
#define HFXO0_NS           ((HFXO_TypeDef *) HFXO0_NS_BASE)                   /**< HFXO0_NS base pointer */
#define HFRCO0_NS          ((HFRCO_TypeDef *) HFRCO0_NS_BASE)                 /**< HFRCO0_NS base pointer */
#define FSRCO_NS           ((FSRCO_TypeDef *) FSRCO_NS_BASE)                  /**< FSRCO_NS base pointer */
#define DPLL0_NS           ((DPLL_TypeDef *) DPLL0_NS_BASE)                   /**< DPLL0_NS base pointer */
#define LFXO_NS            ((LFXO_TypeDef *) LFXO_NS_BASE)                    /**< LFXO_NS base pointer */
#define LFRCO_NS           ((LFRCO_TypeDef *) LFRCO_NS_BASE)                  /**< LFRCO_NS base pointer */
#define ULFRCO_NS          ((ULFRCO_TypeDef *) ULFRCO_NS_BASE)                /**< ULFRCO_NS base pointer */
#define MSC_NS             ((MSC_TypeDef *) MSC_NS_BASE)                      /**< MSC_NS base pointer */
#define ICACHE0_NS         ((ICACHE_TypeDef *) ICACHE0_NS_BASE)               /**< ICACHE0_NS base pointer */
#define PRS_NS             ((PRS_TypeDef *) PRS_NS_BASE)                      /**< PRS_NS base pointer */
#define GPIO_NS            ((GPIO_TypeDef *) GPIO_NS_BASE)                    /**< GPIO_NS base pointer */
#define LDMA_NS            ((LDMA_TypeDef *) LDMA_NS_BASE)                    /**< LDMA_NS base pointer */
#define LDMAXBAR_NS        ((LDMAXBAR_TypeDef *) LDMAXBAR_NS_BASE)            /**< LDMAXBAR_NS base pointer */
#define TIMER0_NS          ((TIMER_TypeDef *) TIMER0_NS_BASE)                 /**< TIMER0_NS base pointer */
#define TIMER1_NS          ((TIMER_TypeDef *) TIMER1_NS_BASE)                 /**< TIMER1_NS base pointer */
#define TIMER2_NS          ((TIMER_TypeDef *) TIMER2_NS_BASE)                 /**< TIMER2_NS base pointer */
#define TIMER3_NS          ((TIMER_TypeDef *) TIMER3_NS_BASE)                 /**< TIMER3_NS base pointer */
#define TIMER4_NS          ((TIMER_TypeDef *) TIMER4_NS_BASE)                 /**< TIMER4_NS base pointer */
#define USART0_NS          ((USART_TypeDef *) USART0_NS_BASE)                 /**< USART0_NS base pointer */
#define USART1_NS          ((USART_TypeDef *) USART1_NS_BASE)                 /**< USART1_NS base pointer */
#define BURTC_NS           ((BURTC_TypeDef *) BURTC_NS_BASE)                  /**< BURTC_NS base pointer */
#define I2C1_NS            ((I2C_TypeDef *) I2C1_NS_BASE)                     /**< I2C1_NS base pointer */
#define SYSCFG_NS_CFGNS    ((SYSCFG_CFGNS_TypeDef *) SYSCFG_NS_CFGNS_BASE)    /**< SYSCFG_NS_CFGNS base pointer */
#define SYSCFG_NS          ((SYSCFG_TypeDef *) SYSCFG_NS_BASE)                /**< SYSCFG_NS base pointer */
#define BURAM_NS           ((BURAM_TypeDef *) BURAM_NS_BASE)                  /**< BURAM_NS base pointer */
#define GPCRC_NS           ((GPCRC_TypeDef *) GPCRC_NS_BASE)                  /**< GPCRC_NS base pointer */
#define DCDC_NS            ((DCDC_TypeDef *) DCDC_NS_BASE)                    /**< DCDC_NS base pointer */
#define PDM_NS             ((PDM_TypeDef *) PDM_NS_BASE)                      /**< PDM_NS base pointer */
#define SEPUF_NS_APBCFG    ((SEPUF_APBCFG_TypeDef *) SEPUF_NS_APBCFG_BASE)    /**< SEPUF_NS_APBCFG base pointer */
#define ETAMPDET_NS        ((ETAMPDET_TypeDef *) ETAMPDET_NS_BASE)            /**< ETAMPDET_NS base pointer */
#define RADIOAES_NS        ((AES_TypeDef *) RADIOAES_NS_BASE)                 /**< RADIOAES_NS base pointer */
#define SMU_NS             ((SMU_TypeDef *) SMU_NS_BASE)                      /**< SMU_NS base pointer */
#define SMU_NS_CFGNS       ((SMU_CFGNS_TypeDef *) SMU_NS_CFGNS_BASE)          /**< SMU_NS_CFGNS base pointer */
#define RTCC_NS            ((RTCC_TypeDef *) RTCC_NS_BASE)                    /**< RTCC_NS base pointer */
#define LETIMER0_NS        ((LETIMER_TypeDef *) LETIMER0_NS_BASE)             /**< LETIMER0_NS base pointer */
#define IADC0_NS           ((IADC_TypeDef *) IADC0_NS_BASE)                   /**< IADC0_NS base pointer */
#define ACMP0_NS           ((ACMP_TypeDef *) ACMP0_NS_BASE)                   /**< ACMP0_NS base pointer */
#define I2C0_NS            ((I2C_TypeDef *) I2C0_NS_BASE)                     /**< I2C0_NS base pointer */
#define WDOG0_NS           ((WDOG_TypeDef *) WDOG0_NS_BASE)                   /**< WDOG0_NS base pointer */
#define AMUXCP0_NS         ((AMUXCP_TypeDef *) AMUXCP0_NS_BASE)               /**< AMUXCP0_NS base pointer */
#define EUSART0_NS         ((EUSART_TypeDef *) EUSART0_NS_BASE)               /**< EUSART0_NS base pointer */
#define CRYPTOACC_NS       ((CRYPTOACC_TypeDef *) CRYPTOACC_NS_BASE)          /**< CRYPTOACC_NS base pointer */
#define PRORTC_NS          ((RTCC_TypeDef *) PRORTC_NS_BASE)                  /**< PRORTC_NS base pointer */
#define EMU                ((EMU_TypeDef *) EMU_BASE)                         /**< EMU base pointer */
#define CMU                ((CMU_TypeDef *) CMU_BASE)                         /**< CMU base pointer */
#define HFXO0              ((HFXO_TypeDef *) HFXO0_BASE)                      /**< HFXO0 base pointer */
#define HFRCO0             ((HFRCO_TypeDef *) HFRCO0_BASE)                    /**< HFRCO0 base pointer */
#define FSRCO              ((FSRCO_TypeDef *) FSRCO_BASE)                     /**< FSRCO base pointer */
#define DPLL0              ((DPLL_TypeDef *) DPLL0_BASE)                      /**< DPLL0 base pointer */
#define LFXO               ((LFXO_TypeDef *) LFXO_BASE)                       /**< LFXO base pointer */
#define LFRCO              ((LFRCO_TypeDef *) LFRCO_BASE)                     /**< LFRCO base pointer */
#define ULFRCO             ((ULFRCO_TypeDef *) ULFRCO_BASE)                   /**< ULFRCO base pointer */
#define MSC                ((MSC_TypeDef *) MSC_BASE)                         /**< MSC base pointer */
#define ICACHE0            ((ICACHE_TypeDef *) ICACHE0_BASE)                  /**< ICACHE0 base pointer */
#define PRS                ((PRS_TypeDef *) PRS_BASE)                         /**< PRS base pointer */
#define GPIO               ((GPIO_TypeDef *) GPIO_BASE)                       /**< GPIO base pointer */
#define LDMA               ((LDMA_TypeDef *) LDMA_BASE)                       /**< LDMA base pointer */
#define LDMAXBAR           ((LDMAXBAR_TypeDef *) LDMAXBAR_BASE)               /**< LDMAXBAR base pointer */
#define TIMER0             ((TIMER_TypeDef *) TIMER0_BASE)                    /**< TIMER0 base pointer */
#define TIMER1             ((TIMER_TypeDef *) TIMER1_BASE)                    /**< TIMER1 base pointer */
#define TIMER2             ((TIMER_TypeDef *) TIMER2_BASE)                    /**< TIMER2 base pointer */
#define TIMER3             ((TIMER_TypeDef *) TIMER3_BASE)                    /**< TIMER3 base pointer */
#define TIMER4             ((TIMER_TypeDef *) TIMER4_BASE)                    /**< TIMER4 base pointer */
#define USART0             ((USART_TypeDef *) USART0_BASE)                    /**< USART0 base pointer */
#define USART1             ((USART_TypeDef *) USART1_BASE)                    /**< USART1 base pointer */
#define BURTC              ((BURTC_TypeDef *) BURTC_BASE)                     /**< BURTC base pointer */
#define I2C1               ((I2C_TypeDef *) I2C1_BASE)                        /**< I2C1 base pointer */
#define SYSCFG_CFGNS       ((SYSCFG_CFGNS_TypeDef *) SYSCFG_CFGNS_BASE)       /**< SYSCFG_CFGNS base pointer */
#define SYSCFG             ((SYSCFG_TypeDef *) SYSCFG_BASE)                   /**< SYSCFG base pointer */
#define BURAM              ((BURAM_TypeDef *) BURAM_BASE)                     /**< BURAM base pointer */
#define GPCRC              ((GPCRC_TypeDef *) GPCRC_BASE)                     /**< GPCRC base pointer */
#define DCDC               ((DCDC_TypeDef *) DCDC_BASE)                       /**< DCDC base pointer */
#define PDM                ((PDM_TypeDef *) PDM_BASE)                         /**< PDM base pointer */
#define SEPUF_APBCFG       ((SEPUF_APBCFG_TypeDef *) SEPUF_APBCFG_BASE)       /**< SEPUF_APBCFG base pointer */
#define ETAMPDET           ((ETAMPDET_TypeDef *) ETAMPDET_BASE)               /**< ETAMPDET base pointer */
#define RADIOAES           ((AES_TypeDef *) RADIOAES_BASE)                    /**< RADIOAES base pointer */
#define SMU                ((SMU_TypeDef *) SMU_BASE)                         /**< SMU base pointer */
#define SMU_CFGNS          ((SMU_CFGNS_TypeDef *) SMU_CFGNS_BASE)             /**< SMU_CFGNS base pointer */
#define RTCC               ((RTCC_TypeDef *) RTCC_BASE)                       /**< RTCC base pointer */
#define LETIMER0           ((LETIMER_TypeDef *) LETIMER0_BASE)                /**< LETIMER0 base pointer */
#define IADC0              ((IADC_TypeDef *) IADC0_BASE)                      /**< IADC0 base pointer */
#define ACMP0              ((ACMP_TypeDef *) ACMP0_BASE)                      /**< ACMP0 base pointer */
#define I2C0               ((I2C_TypeDef *) I2C0_BASE)                        /**< I2C0 base pointer */
#define WDOG0              ((WDOG_TypeDef *) WDOG0_BASE)                      /**< WDOG0 base pointer */
#define AMUXCP0            ((AMUXCP_TypeDef *) AMUXCP0_BASE)                  /**< AMUXCP0 base pointer */
#define EUSART0            ((EUSART_TypeDef *) EUSART0_BASE)                  /**< EUSART0 base pointer */
#define CRYPTOACC          ((CRYPTOACC_TypeDef *) CRYPTOACC_BASE)             /**< CRYPTOACC base pointer */
#define PRORTC             ((RTCC_TypeDef *) PRORTC_BASE)                     /**< PRORTC base pointer */
#define DEVINFO            ((DEVINFO_TypeDef *) DEVINFO_BASE)                 /**< DEVINFO base pointer */
/** @} End of group EFR32BG27C320F768GJ39_Peripheral_Declaration */

/**************************************************************************//**
 * @defgroup EFR32BG27C320F768GJ39_Peripheral_Parameters EFR32BG27C320F768GJ39 Peripheral Parameters
 * @{
 * @brief Device peripheral parameter values
 *****************************************************************************/

